[
    {
        "name": "Ben Justman",
        "npub": "npub153xmex42x4chdf757hp3q6zxagykkek7pdgwuwd074964dkyha9s82ryu8",
        "text": "Yo. Oshi bars are INSANELY good. I'm blown away."
    },
    {
        "name": "Soap Miner",
        "npub": "npub1zzmxvr9sw49lhzfx236aweurt8h5tmzjw7x3gfsazlgd8j64ql0sexw5wy",
        "text": "Over the weekend, I got to experience @oshi sweet treats.\n\nThe word \"amazing\" doesn't do them justice.\n\nMy wife and I split them over the weekend. We had one Mint Cookie Hodl bar, and one Banana chocolate chip. The hodl bars were delish, however, we also got a jar of the Hodl Butter.\n\nI'm just forewarning you here. If you have an addictive personality, do not under any circumstances open the Hodl Butter. OMG!! It is so freaking good!! It's hard to stop at just a spoonful. The texture is perfect, and has just the right amount of sweetness. And it's completely addicting. Will definitely be getting more of this, and wife already wants to get some for her brother for his bday in a cpl months.\n\nKeep it up @oshi! You definitely know what you're doing brother!"
    },
    {
        "name": "Yarnlady",
         "npub": "npub1hgvtv4zn2l8l3ef34n87r4sf5s00xq3lhgr3mvwt7kn8gjxpjprqc89jnv",
        "text": "OMFG Hodl bars are everything everyone says they are. As a not huge fan of mint...OMG it's so good, it's not overpowering and I really like it thank you for making me wait 😆! The rest of the banana one is mine, the kid and husband can have some of the mint one (maybe). You rock, they're fckn amazing. Will try to snap some pics for proof of eat tomorrow. And thanks for the note ☺️, will get the trade out soon!"
    },
    {
        "name": "buchi",
         "npub": "npub1hgvtv4zn2l8l3ef34n87r4sf5s00xq3lhgr3mvwt7kn8gjxpjprqc89jnv",
        "text": "I ate half the jar in one day. That’s the review.\n\nI honestly thought all the reviews were people dickriding simply because it was some guy selling goods for sats on nostr. I was wrong. This shit is amazing. I wish i could order in bulk.\n\nThank you @oshi."
    },
    {
        "name": "CraftCanna",
        "npub": "npub1jt5l9v9yrn3nxmjhgcq0hw9llym6ucvn9vknflwrn87u5gah09uqftzwrd",
        "text": "Traded some of my high-grade cannabis for these hodl bars from Oshi and I have to say they’re an A1 munchie. Best munchies on #nostr Thoroughly recommend.\n\nNow I just have to figure out how to not eat them all in one night…"
    },
    {
        "name": "Leo",
        "npub": "npub1pt8aea3d7wqm37zkhyjk9qlpgsm9mg7nsnaynxkwtqja6ut77dpqqg5z7v",
        "text": "Yooo this bar is amazing! 🤤 Thank you 🙏"
    },
    {
        "name": "Meyer",
        "npub": "npub15axsm63lprp2fsx6k8k7zx4k3pxz8k3q7muy95huzz5hwsl8qcrq4g4hv7",
        "text": "Broke into the latest @oshi shipment last night/this morning.\n\nBanana chocolate bar was phenomenal! I couldn't help myself and finished the last quarter this morning after my run.\n\n2nd jar of Hodl butter is just as good as the first time we ordered. Far superior to peanut butter. Has texture and not overly sticky.\n\nWell done sir! You have a repeat customer with this family (need the little nodes again for the kids ha)."
    },
    {
        "name": "Shane",
        "npub": "npub1pwqjj89lrdsmwxe8zng5jm2kpcmn76h5d0yupxcjqrd0cj0qgqjqznt43l",
        "text": "Hodl pecan butter is now my families FAVORITE nut butter spread Oshi delivered 😋"
    },
    {
        "name": "Jordan S",
        "npub": "npub1p3za04z7mv86mkjzzhfkegxe4wsvwudct5m3wajt3gfg6hjy8exslltqmk",
        "text": "My honest review on Oshi.\n\nI heavily recommend all three of them for people who like nut, chocolate, fruit, and mint.\n\nIt's phenomenal flavor, really well made.\n\nThey're not like most snack/energy bars that are made out of grain.\n\nThey are soft, and chewy unless you refrigerate them.\n\nThe HODL Butter also recommend to refrigerate, and stir before eating.\n\nHowever, you can eat them either way 😃.\n\nOshi is really tasty 😋👌."
    },
    {
        "name": "PDJ",
        "npub": "npub1jcr32x73453qdjp9wplk5kp6mxhdzttrvl4dvfhtyj3f8punn2hqds3whq",
        "text": "True story about introducing Oshi bars to the homies.\n\nOne has coeliac disease (Don’t worry we make sure he feel’s inadequate each time it comes up) so he originally declined tasting some.\n\nHe’s a pleb though so when he heard it was paid for in sats, he felt obligated to put himself in harms way.\n\nI felt like I was watching a documentary on Normandy.\n\nPleb blood is ice cold.  What a legend.\n\nTurns out Oshi bars didn’t trigger any Coeliac reaction either.\n\nWe’re winning you sons’abitches.\n\nWe’re winning."
    },
    {
        "name": "Scott",
        "npub": "npub1luvpvkhauqy994y6fcf3djvpc7hszexpsyxqhs87g8fkrhtu5lcqylnmt5",
        "text": "I recently received my second order of Hodl Butter from Oshi; this time, due to the impressive quality of my first Hodl Butter order, I decided to try some Hodl Bars as well. Put on your five-point racing harness and get those paddle-shifting fingers ready, because it’s time for a deep dive into another of Oshi‘s products that’ll have you zapping your order so quick you’d think you were trying to enter the Konami code with a jackhammer.\n\nTwo Banana Chocolate Chip Hodl Bars arrived at my door, right on schedule, shipped with a tracking number that I was provided by Oshi. Being able to communicate directly with the person that made the product, packaged it and shipped it to me gave me a sense of reassurance that simply does not exist when ordering a perishable item over the Fiat Internet.\n\nThe Hodl Bars were securely and simply packaged, and included a personal Thank You note from Oshi , as well as two stickers for Hujai, a music project he’s been working on for awhile. Do yourself a favor and check it out as well if you enjoy great instrumental music.\n\nThese Hodl Bars have but ten ingredients; this, though not proving the existence of ancient aliens, is IN FACT the total number of fingers of two human hands (barring any accidents with industrial machinery).\n\nHere are the aforementioned ingredients:\ndates, pecan butter, banana, dark chocolate chips, peanut flour, cacao powder, cacao nibs, cinnamon, sea salt & black pepper.\n\nThat’s it. No pool chemicals, nothing meant to restore “natural” hair growth, nothing meant to increase the length or girth of any appendage, and nothing that will cause your face to sag like a pair of tapered-leg jeans.\n\nThese are actual ingredients that human beings have been using years before AI came along to help us read.\n\nEndeavoring to savor each bite of my newly arrived Hodl Bars, I had prepared a pitcher of vanilla iced tea to accompany this review the evening before. Hodl Butter is best refrigerated, and I suggest also placing Hodl Bars in the fridge to keep them from idle snacking, as they are individually handmade and therefore are not cheap.\n\nI began by taking a small bite of a chilled Hodl Bar and remembered that the last time I had tried a date was many years ago. Of course, I was prepared for a very sweet, dessert-like taste initially; but a small, dark brown, square-shaped baked item will unconsciously make most any brain jump to that conclusion even before it reaches the palette. While these Hodl Bars are certainly sweet, the natural sugars are balanced serendipitously with the savory black pepper and the mild tartness of the dates. This perfect balance is not unlike the refreshing feeling of a new mattress after days of sleeping on the floor.\n\nAfter a single bite, I was struck by an idea as clear as polished ice after a couple passes with a Zamboni: The splendid density and flavorful complexity of a Hodl Bar may be enjoyed EVEN MORE when warmed and complimented by a topping of Hodl Butter.\n\nWhen ideas of this certainty and magnitude occur to a person, it is necessary to act immediately and with galvanized effort.\n\nInto the microwave for ten seconds the Hodl Bar went, and I fondly awaited its arrival with a jar of Hodl Butter in one hand, titanium spork in the other. Having assembled the sumptuous snack thusly, I tasted it and discovered what I will term The Hodl Entourage Effect.\n\nThe warm, soft Hodl Bar is as perfectly complemented by the cool, creamy Hodl Butter as a Savile Row suit is complemented by a bespoke Patek Philippe watch. The delicate caramel undertone of both the Bar and Butter intermingle in such a way as to afford their audience a tasteful journey to distant lands and memories of late night fireside chats with friends.\n\nI consumed the Hodl Bar slowly and carefully, as I relished each bite with the patient assurance that I had another Hodl Bar waiting in the fridge for my next tasteful experience. My sats were indeed well spent, I mused, as I gazed upon the now-empty wrapper like a punched train ticket to a snow-capped mountain village.\n\nIf you’re in the market for a masterfully-crafted snack, made by hand with safe, healthy ingredients, and shipped to you by the very same person who created it, look no further than Hodl Bars. And if you enjoy indefatigable luxury of a transcendently paired aperitif, order a jar of Hodl Butter, put some Butter on the Bars, and prepare for a taste journey that’ll make you want to start a podcast just to tell people how awesome you are now that you’ve tried them.\n\nAnd with that, I conclude my review. Please bear in mind that Oshi has several varieties of Hodl Bars available and is working on new products all the time. They are all fantastic, I am sure.\n\nWhen you want to take a breather from stacking, do some pushups and get some Hodl Bars and Hodl Butter from Oshi. No further explanation is needed, frens."
    },
    {
        "name": "Baked Potato",
        "npub": "npub1f0e6xymc9hy4wmepa7em60tp8p7s6kgnq53q06grq6n5r0m27l2s6tc5r6",
        "text": "I've been an Oshi customer for a few months now and I've never for one moment regretted a purchase. You know those times where you bought something and you wish you could take it back or unswallow it? Never that with my dude Oshi. Very few things outside of grandma's baked cookies, or farmer's market fresh zucchini really feel like they came from a place of love these days. There's no milk man anymore or neighborhood butcher for most of us.  Food is for most of us transactional, kind of sterile. Enter grocery store, grab cart, wander around aisles, look for deals and throw item in cart. Scan items at self-checkout. Lately I've been looking for more meaning every where, meaning in my money (bitcoin), meaning in my relationships, meaning in my job, meaning in my community, and meaning in my food. I can't think of a better combination than exchanging the money that I hold dear with  a more meaningful relationship with my food and with a really nice dude that makes things with love. HODL butter genuinely makes me happy. I have to share it with the family, and sometimes it's mysteriously gone and I want to interrogate everyone to root out the HODL thief. But really it makes me happy that there are people out there making stuff in exchange for Bitcoin and it makes my loved ones happy. We need more of this. Anywho, someone said I should write a review of the new HODL bar's. And this little rant emerged instead. They are delicious for all of the reasons I said before and because they are freaking delicious. They traveled half-way across the country and they were still chewy and flavorful and not too over powering in any flavor, a nice satisfying balance. I have a principle of never telling anyone what they should do, but if you like quality products and are willing to use Bitcoin in a peer to peer transaction, than Oshi is your man. It's ok to HODL, but it's also ok to spend your hard earned sats on things you value. Thanks Oshi and the rest of you Nostr pioneers. Bitcoin is money. "
    },
    {
        "name": "TheRupertDamnit",
        "npub": "npub1r8u6lw8c2h67s66magtqu78vtpckfzcsmmdsg06gqm723njsunfs8kfjwl",
        "text": "Oh Oshi!\n\nEveryone on #thenostr should be saying that by now. I recently nabbed a jar of his #hodlbutter, and lemme tell you, I couldn’t have been more excited. I’ve been seeing folks bragging about getting some for weeks now, and I had to have my own. When my package arrived, I immediately smeared some on a slice of toast and drizzled it with hot honey. The flavor combo was out of this world, and I knew this was the beginning of something special. The balance of sweet, nutty, and spicy was true perfection.\n\nEveryone seemed to be really enjoying it on steak or just straight from the jar (like the creator himself), but I really felt the pecan flavors would lend themselves well to fish. Kajoozie Maflingo and I like to consider ourselves a bit adventurous with flavors and set to work creating something unforgettable. We decided to make a sauce using the Hodl Butter as the base. Don’t let anyone tell you that citrus doesn’t belong in savory dishes because blood orange juice, hot honey, and Oshi #hodlbutter are a throuple from culinary heaven.\n\nI suppose I’ll go ahead and try it on steak soon too, though I don’t think this fish dish can be topped. It’ll definitely be deliciously nutty finding out. Thanks, Oshi . You’ve made my tastebuds sing."
    },
    {
        "name": "PDJ",
        "npub": "npub1jcr32x73453qdjp9wplk5kp6mxhdzttrvl4dvfhtyj3f8punn2hqds3whq",
        "text": "Confirming that Oshi bars are best in class.\n\n#WorthTheSats"
     },
     {
        "name": "ChadF",
        "npub": "npub177fz5zkm87jdmf0we2nz7mm7uc2e7l64uzqrv6rvdrsg8qkrg7yqx0aaq7",
        "text": "The @oshi Hodl Bars and Hodl Butter have arrived. I've seen a lot of people talking about these bars and I have to say they live up to the hype. They have a chocolate banana flavor thats absolutely delicious.\n\nThe Hodl Butter is up next. What are y'all using it for or on? I'd love to know. @oshi doing giveaways like this is such a great idea. 🤙"
     }
]

